import { ReviewCardBasicProps } from '../review-card/types';

export const reviewsEkpSpb: ReviewCardBasicProps[] = [
  {
    headline: 'Очень хороший ресурс! Просто классный',
    rating: 4.5,
    review:
      'Наряду с этим, изменение глобальной стратегии развивает культурный имидж. До недавнего времени считалось, что реклама вырождена.',
    author: 'Смирнов Павел',
    date: '15 дек. 2021',
  },
  {
    headline: 'Очень хороший ресурс! Просто классный',
    rating: 4.5,
    review: 'Наряду с этим, изменение глобальной стратегии развивает культурный имидж.',
    author: 'Смирнов Павел',
    date: '15 дек. 2021',
  },
  {
    headline: 'Очень хороший ресурс! Просто классный',
    rating: 4.5,
    review:
      'Наряду с этим, изменение глобальной стратегии развивает культурный имидж. До недавнего времени считалось, что реклама вырождена. Рекламное сообщество определяет пресс-клиппинг.',
    author: 'Смирнов Павел',
    date: '15 дек. 2021',
  },
  {
    headline: 'Очень хороший ресурс! Просто классный',
    rating: 4.5,
    review:
      'Наряду с этим, изменение глобальной стратегии развивает культурный имидж. До недавнего времени считалось, что реклама вырождена. Рекламное сообщество определяет пресс-клиппинг.',
    author: 'Смирнов Павел',
    date: '15 дек. 2021',
  },
  {
    headline: 'Очень хороший ресурс! Просто классный',
    rating: 4.5,
    review:
      'Наряду с этим, изменение глобальной стратегии развивает культурный имидж. До недавнего времени считалось, что реклама вырождена. Рекламное сообщество определяет пресс-клиппинг.',
    author: 'Смирновcкий Иннокентий',
    date: '15 дек. 2021',
  },
  {
    headline: 'Очень хороший ресурс! Просто классный',
    rating: 4.5,
    review: 'Наряду с этим, изменение глобальной стратегии развивает культурный имидж.',
    author: 'Барабулькинкович Барабулька',
    date: '15 дек. 2021',
  },
];
