import { SocialRole as SocialRoleProps } from 'generated/graphql';
import iLiveHere from '../../../public/assets/social-icons-main/iLiveHere.svg';
import loveSpb from '../../../public/assets/social-icons-main/loveSpb.svg';
import newRole from '../../../public/assets/social-icons-main/newRole.svg';
import parent from '../../../public/assets/social-icons-main/parent.svg';

export const mainSocialBtnsArray: SocialRoleProps[] = [
  {
    id: '1',
    created_at: 'today',
    updated_at: 'yesterday',
    Name: 'Я родитель',
    Icon: parent,
    Description:
      'Мы приступили к реализации новых решений для роли «Я – Родитель». В настоящее время в Петербурге проживает более 600 тыс. семей с детьми, и каждый день многие из них сталкиваются с непростыми задачами, решить которые возможно при помощи цифровых услуг. Присоединяйтесь к обсуждению – ваше мнение для нас очень важно!',
  },
  {
    id: '2',
    created_at: 'today',
    updated_at: 'yesterday',
    Name: 'Я люблю Петербург',
    Icon: loveSpb,
    Description:
      'Мы приступили к реализации новых решений для роли «Я – Родитель». В настоящее время в Петербурге проживает более 600 тыс. семей с детьми, и каждый день многие из них сталкиваются с непростыми задачами, решить которые возможно при помощи цифровых услуг. Присоединяйтесь к обсуждению – ваше мнение для нас очень важно!',
  },
  {
    id: '3',
    created_at: 'today',
    updated_at: 'yesterday',
    Name: 'Я здесь живу',
    Icon: iLiveHere,
    Description:
      'Мы приступили к реализации новых решений для роли «Я – Родитель». В настоящее время в Петербурге проживает более 600 тыс. семей с детьми, и каждый день многие из них сталкиваются с непростыми задачами, решить которые возможно при помощи цифровых услуг. Присоединяйтесь к обсуждению – ваше мнение для нас очень важно!',
  },
  {
    id: '4',
    created_at: 'today',
    updated_at: 'yesterday',
    Name: 'Я родитель',
    Icon: parent,
    Description:
      'Мы приступили к реализации новых решений для роли «Я – Родитель». В настоящее время в Петербурге проживает более 600 тыс. семей с детьми, и каждый день многие из них сталкиваются с непростыми задачами, решить которые возможно при помощи цифровых услуг. Присоединяйтесь к обсуждению – ваше мнение для нас очень важно!',
  },
  {
    id: '65',
    created_at: 'today',
    updated_at: 'yesterday',
    Name: 'Я люблю Петербург',
    Icon: loveSpb,
    Description:
      'Мы приступили к реализации новых решений для роли «Я – Родитель». В настоящее время в Петербурге проживает более 600 тыс. семей с детьми, и каждый день многие из них сталкиваются с непростыми задачами, решить которые возможно при помощи цифровых услуг. Присоединяйтесь к обсуждению – ваше мнение для нас очень важно!',
  },
  {
    id: '1123',
    created_at: 'today',
    updated_at: 'yesterday',
    Name: 'Я здесь живу',
    Icon: iLiveHere,
    Description:
      'Мы приступили к реализации новых решений для роли «Я – Родитель». В настоящее время в Петербурге проживает более 600 тыс. семей с детьми, и каждый день многие из них сталкиваются с непростыми задачами, решить которые возможно при помощи цифровых услуг. Присоединяйтесь к обсуждению – ваше мнение для нас очень важно!',
  },
  {
    id: '1132',
    created_at: 'today',
    updated_at: 'yesterday',
    Name: 'Я родитель',
    Icon: parent,
    Description:
      'Мы приступили к реализации новых решений для роли «Я – Родитель». В настоящее время в Петербурге проживает более 600 тыс. семей с детьми, и каждый день многие из них сталкиваются с непростыми задачами, решить которые возможно при помощи цифровых услуг. Присоединяйтесь к обсуждению – ваше мнение для нас очень важно!',
  },
  {
    id: '125325',
    created_at: 'today',
    updated_at: 'yesterday',
    Name: 'Я люблю Петербург',
    Icon: loveSpb,
    Description:
      'Мы приступили к реализации новых решений для роли «Я – Родитель». В настоящее время в Петербурге проживает более 600 тыс. семей с детьми, и каждый день многие из них сталкиваются с непростыми задачами, решить которые возможно при помощи цифровых услуг. Присоединяйтесь к обсуждению – ваше мнение для нас очень важно!',
  },
  {
    id: '432421',
    created_at: 'today',
    updated_at: 'yesterday',
    Name: 'Я здесь живу',
    Icon: iLiveHere,
    Description:
      'Мы приступили к реализации новых решений для роли «Я – Родитель». В настоящее время в Петербурге проживает более 600 тыс. семей с детьми, и каждый день многие из них сталкиваются с непростыми задачами, решить которые возможно при помощи цифровых услуг. Присоединяйтесь к обсуждению – ваше мнение для нас очень важно!',
  },
  {
    id: '1132123',
    created_at: 'today',
    updated_at: 'yesterday',
    Name: 'Добавь свою роль',
    Icon: newRole,
  },
];
